app/Controllers/UsuarioC.php

SELECT *
FROM `perfis`
WHERE `status` = 1
---
		}

		// Carrega todos os perfis ativos
		$perfis = $this->perfil->where('status', 1)->findAll();

SELECT *
FROM `usuarios`
WHERE `id` = '3'
 LIMIT 1
SELECT *
FROM `pessoas`
WHERE `id` = '8'
 LIMIT 1
SELECT *
FROM `pessoas`
WHERE `email` = 'djaene@gmail.com'
AND `id` != '8'
 LIMIT 1
---
	public function alterar($usuario_id) {
		$usuario_sessao = $this->session->get('usuario');
		if(is_null($usuario_sessao)) {
			return redirect()->route('login');
		}
		$data['msg'] = "";
		$data['msg_type'] = "";
		$data['errors'] = [];

		// Usuário
		$usuario = $this->usuario->where('id', $usuario_id)->first();
		// Pessoa
		$pessoa = $this->pessoa->where('id', $usuario->pessoa_id)->first();

		if($this->request->getMethod() === 'post') {
			$status = true;

			$nome = ucwords(strtolower($this->request->getPost('nome')));
			$tipo_documento = $this->request->getPost('tipo_documento');
			$documento = $tipo_documento == "EXT" ? $this->request->getPost('documento') : somenteNumeros($this->request->getPost('documento'));
			$data_nascimento = $this->request->getPost('data_nascimento');
			$sexo = $this->request->getPost('sexo');
			$email = strtolower($this->request->getPost('email'));
			$senha = trim($this->request->getPost('senha')) != '' ? strtolower($this->request->getPost('senha')) : null;
			$estado_civil = $this->request->getPost('estado_civil');
			$telefone = $this->request->getPost('telefone');
			$perfil_id = $this->request->getPost('perfil_id');
			$tipo_status_id = $this->request->getPost('tipo_status_id') != null && $this->request->getPost('tipo_status_id') != '' ? $this->request->getPost('tipo_status_id') : null;

			// Validação dos dados
			$result = $this->pessoa->where('email', $email)->where('id !=', $usuario->pessoa_id)->first();

SELECT *
FROM `pessoas`
WHERE `documento` = '06831068995'
AND `tipo_documento` = 'CPF'
AND `id` != '8'
 LIMIT 1
---
				array_push($data['errors'], "Email já cadastrado.");
				$status = false;
			}
			$result = $this->pessoa->where('documento', $documento)->where('tipo_documento', $tipo_documento)->where('id !=', $usuario->pessoa_id)->first();

SELECT *
FROM `perfis`
WHERE `status` = 1
---
		}

		// Carrega todos os perfis ativos
		$perfis = $this->perfil->where('status', 1)->findAll();