app/Models/Usuario.php

				"data_ultimo_login" => date('Y-m-d H:i:s'),
				"ip_ultimo_login" => getIpClient()
			);
			$this->update($usuario->id, $data);
---
UPDATE `usuarios` SET `data_ultimo_login` = '2024-01-18 14:19:30', `ip_ultimo_login` = '177.135.93.68'
WHERE `usuarios`.`id` IN ('1')

	public function alterar($dados) {
		try {
			$this->db->transException(true)->transStart();


			$dados_pessoa = array(
				"documento" => $dados->documento,
				"tipo_documento" => $dados->tipo_documento,
				"nome" => $dados->nome,
				"sexo" => $dados->sexo,
				"data_nascimento" => $dados->data_nascimento,
				"estado_civil" => $dados->estado_civil,
				"telefone" => $dados->telefone,
				"email" => $dados->email,
				"data_alteracao" => $dados->data_alteracao,
				"usuario_alteracao_id" => $dados->usuario_alteracao_id
			);

			$pessoa_atualizada = $this->pessoa->update($dados->pessoa_id, $dados_pessoa);
---
UPDATE `pessoas` SET `documento` = '06831068995', `tipo_documento` = 'CPF', `nome` = 'Djaene Da Silva', `sexo` = 'feminino', `data_nascimento` = '1989-04-12', `estado_civil` = 'união estável', `telefone` = '(41) 99956-3613', `email` = 'djaene@gmail.com', `data_alteracao` = '2024-01-18 14:19:41', `usuario_alteracao_id` = '1'
WHERE `pessoas`.`id` IN ('8')

					$dados_usuario['status'] = $dados->status;
				}

				$usuario_atualizado = $this->update($dados->usuario_id, $dados_usuario);
---
UPDATE `usuarios` SET `pessoa_id` = '8', `perfil_id` = '1', `chave_ativacao` = '06831068995djaene@gmail.com', `data_alteracao` = '2024-01-18 14:19:41', `usuario_alteracao_id` = '1'
WHERE `usuarios`.`id` IN ('3')